#!/usr/bin/python3
# -*- coding:utf-8 -*-


# ====================================================
# 内容描述： python编程语言概述
# ====================================================



"""

    Python是著名的“龟叔”Guido van Rossum在1989年圣诞节期间，为了打发无聊的圣诞节而编写的一个编程语言。
    Python是一门面向对象的解释型脚本编程语言
    Python是一门简单的高级编程语言，但是高级不等同于简单。但是对于新手和初学者，非常容易上手


一、产生背景：

    1、龟叔为了打发无聊的圣诞节完成的
    2、为了解决代码段必须写在{}之间的繁琐
    3、为了开发一款快速，简单易用



二、python编程语言的应用场景

    1、系统运维
    2、网络爬虫
    3、科学计算/数据分析
    4、web开发



三、python的优缺点

    1、优点
        快速上手，简单易用
        内置电池
        胶水编程语言
        人生苦短我用python

    2、缺点
        发布项目等同于发布源码
        执行速率要慢于其他编译型编程语言，比如C和Java


四、代码规范：

    1、缩进控制代码段

        通常有三种方式：
        a、两个空格
        b、四个空格
        c、一个制表符

    2、行宽， 每一行尽量不要太长，可读性和可维护性不高， 一般不要超过80个字符

    3、换行

        a、Python 支持括号内的换行，这时候有两种情况：第二行缩进到括号的起始处， 第二行缩进 4 个空格，适用于起始括号就换行的情形
        b、使用反斜杠\换行，二元运算符+ .等应出现在行末；长字符串也可以用此法换行
        c、禁止复合语句，即一行中包含多个语句
        d、if/for/while一定要换行

    4、空格

        a、在二元运算符两边各空一格[=,-,+=,==,>,in,is not, and]
        b、函数的参数列表中，,之后要有空格
        c、函数的参数列表中，默认值等号两边不要添加空格
        d、左括号之后，右括号之前不要加多余的空格
        e、字典对象的左括号之前不要多余的空格
        f、不要为对齐赋值语句而使用的额外空格

    5、命名规则

        a、模块，模块尽量使用小写命名，首字母保持小写，尽量不要用下划线(除非多个单词，且数量不多的情况)
        b、类名，类名使用驼峰(CamelCase)命名风格，首字母大写，私有类可用一个下划线开头
        c、函数，函数名一律小写，如有多个单词，用下划线隔开
        d、变量名，变量名尽量小写, 如有多个单词，用下划线隔开
        e、常量，常量使用以下划线分隔的大写命名，如有多个单词，使用下划线隔开


"""