#!/usr/bin/python3
# -*- coding:utf-8 -*-


# ====================================================
# 内容描述： 注释相关
# ====================================================


"""
注释的分类：
1、单行注释
2、重要的注释/段落注释
3、文档注释

编写注释的原则：
1、文档注释不限于中英文, 但不要中英文混用
2、文档注释不是越长越好, 通常一两句话能把情况说清楚即可
3、模块、公有类、公有方法, 能写文档注释的, 应该尽量写文档注释
"""


# print(22)  单行注释， 这句代码是被注释掉了的，只是注释当前这一行，所以是单行注释
print(2222)   # 这也是注释，但是之前的代码实可以正常执行的



# ===========================
# 这是重要的注释
# print(33)
# ===========================
print(3333)


'''
这是段落注释
print(44)
'''
print(4444)



"""
这是段落注释
print(55)
"""
print(5555)

## 这是注释么？
aa = """huangbo  wangbaoqian"""
print(aa)