#!/usr/bin/python3
# -*- coding:utf-8 -*-


# ====================================================
# 内容描述： 输入相关
# ====================================================



# Python提供了一个input()，可以让用户输入字符串，并存放到一个变量里
# 不管你输入的是什么，接收到的都是字符串

name = input()
print(name)
## 从input输入的任何数据都是 str 类型
print(type(name))


print("-----------------------1------------------------")
name1 = input("请输入您的姓名：")
print(name1)



print("-----------------------2------------------------")
## 练习：求正方形的面积
print("现在开始求正方形的面积：")
width = input("请输入正方形的边长：")
print("正方形的面积是：", int(width) * int(width))



print("-----------------------3------------------------")
## 练习：求长方形的面积
print("现在开始求长方形的面积：")
length = input("请输入长方形的长：")
width = input("请输入长方形的宽：")
print("长方形的面积是：", int(length) * int(width))